Revit 2027 API
PartMakerMethodToDivideVolumes.UsesReference Method
 Identifies if the PartMaker uses the intersecting reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UsesReference(
	ElementId intersectingReference
)
Public Function UsesReference (
	intersectingReference As ElementId
) As Boolean
public:
bool UsesReference(
	ElementId^ intersectingReference
)
member UsesReference :
        intersectingReference : ElementId -> bool
Parameters
intersectingReference ElementId
 Intersecting reference to be tested.
Return Value
Boolean
 True if the intersecting reference is used by the PartMaker.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace